2023/redis-benchmark/single_core_bench.txt
====== PING_INLINE ======
  100000 requests completed in 1.39 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.2 milliseconds
2.16% <= 0.3 milliseconds
85.58% <= 0.4 milliseconds
92.65% <= 0.5 milliseconds
98.49% <= 0.6 milliseconds
98.97% <= 0.7 milliseconds
99.26% <= 0.8 milliseconds
99.43% <= 0.9 milliseconds
99.67% <= 1.0 milliseconds
99.75% <= 1.1 milliseconds
99.80% <= 1.2 milliseconds
99.86% <= 1.3 milliseconds
99.90% <= 1.4 milliseconds
99.95% <= 1.5 milliseconds
99.97% <= 1.6 milliseconds
99.97% <= 3 milliseconds
100.00% <= 3 milliseconds
71684.59 requests per second

====== PING_BULK ======
  100000 requests completed in 1.41 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.55% <= 1 milliseconds
100.00% <= 1 milliseconds
71123.76 requests per second

====== SET ======
  100000 requests completed in 1.36 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.53% <= 1 milliseconds
100.00% <= 1 milliseconds
73691.97 requests per second

====== GET ======
  100000 requests completed in 1.41 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.60% <= 1 milliseconds
99.94% <= 2 milliseconds
100.00% <= 2 milliseconds
70821.53 requests per second

====== INCR ======
  100000 requests completed in 1.39 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.64% <= 1 milliseconds
100.00% <= 1 milliseconds
72098.05 requests per second

====== LPUSH ======
  100000 requests completed in 1.32 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.55% <= 1 milliseconds
99.95% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 4 milliseconds
75585.79 requests per second

====== RPUSH ======
  100000 requests completed in 1.41 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.66% <= 1 milliseconds
100.00% <= 1 milliseconds
71073.21 requests per second

====== LPOP ======
  100000 requests completed in 1.31 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.72% <= 1 milliseconds
100.00% <= 1 milliseconds
76511.09 requests per second

====== RPOP ======
  100000 requests completed in 1.32 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.72% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
75872.54 requests per second

====== SADD ======
  100000 requests completed in 1.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.64% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
75075.07 requests per second

====== HSET ======
  100000 requests completed in 1.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.61% <= 1 milliseconds
99.95% <= 2 milliseconds
100.00% <= 2 milliseconds
75357.95 requests per second

====== SPOP ======
  100000 requests completed in 1.36 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.73% <= 1 milliseconds
100.00% <= 1 milliseconds
73746.31 requests per second

====== ZADD ======
  100000 requests completed in 1.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.58% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
74626.87 requests per second

====== ZPOPMIN ======
  100000 requests completed in 1.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.55% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
74019.25 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 1.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.97% <= 1 milliseconds
100.00% <= 1 milliseconds
72568.94 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 1.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.57% <= 1 milliseconds
100.00% <= 1 milliseconds
54024.85 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 3.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

88.87% <= 1 milliseconds
99.72% <= 2 milliseconds
100.00% <= 3 milliseconds
100.00% <= 3 milliseconds
27555.80 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 5.46 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.11% <= 1 milliseconds
92.31% <= 2 milliseconds
99.84% <= 3 milliseconds
99.92% <= 4 milliseconds
99.96% <= 5 milliseconds
99.97% <= 6 milliseconds
99.98% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 9 milliseconds
18321.73 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 6.55 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.01% <= 1 milliseconds
94.58% <= 2 milliseconds
99.82% <= 3 milliseconds
99.96% <= 4 milliseconds
100.00% <= 4 milliseconds
15267.17 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 1.27 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.95% <= 1 milliseconds
100.00% <= 1 milliseconds
78616.35 requests per second